import './SidebarSettings.css'
import DateInput from '../FindTicketForm/DateInput/DateInput'
import Checkbox from './Checkbox/Checkbox'
import RangeSliderPrice from './RangeSliderPrice/RangeSliderPrice'
import RangeSliderTime from './RangeSliderTime/RangeSliderTime'
import { useDispatch, useSelector } from 'react-redux'
import { addToTicketDataInfo } from '../../store/ticketFormSlice'; 
import { useState } from 'react';

import arrowTo from '../../img/Subtract (4).png'
import arrowFrom from '../../img/Subtract (5).png'

function SidebarSettings() {
    const dispatch = useDispatch()
    const ticketData = useSelector(state => state.ticketForm.ticketData)

    const [activeThereSlider, setActiveThereSlider] = useState(false)
    const [activeFromSlider, setActiveFromSlider] = useState(false)

    
    const svgs = {
        coupe: <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg"><path fillRule="evenodd" clipRule="evenodd" d="M1.53491 0H15.4651C16.3093 0 17 0.695465 17 1.54544V15.4546C17 16.3045 16.3093 17 15.4651 17H1.53491C0.690674 17 0 16.3045 0 15.4546V1.54544C0 0.695465 0.690674 0 1.53491 0ZM13.1243 2.125C12.7021 2.125 12.3567 2.47272 12.3567 2.89774V4H15.2922V2.89774C15.2922 2.47272 14.947 2.125 14.5249 2.125H13.1243ZM15.2922 5H12.3567V10.0454C12.3567 10.4705 12.7021 10.8182 13.1243 10.8182H14.5249C14.947 10.8182 15.2922 10.4705 15.2922 10.0454V5ZM4.54736 4V2.97501C4.54736 2.51135 4.16357 2.125 3.70312 2.125H2.45605C1.99561 2.125 1.61182 2.51135 1.61182 2.97501V4H4.54736ZM1.61182 5H4.54736V9.98749C4.54736 10.4511 4.16357 10.8375 3.70312 10.8375H2.45605C1.99561 10.8375 1.61182 10.4511 1.61182 9.98749V5ZM15.2349 16.7296C16.0405 16.7296 16.7122 16.0727 16.7122 15.242V12.4796H0.287842V15.242C0.287842 16.0534 0.940186 16.7296 1.76514 16.7296H15.2349Z" fill="#E5E5E5"/></svg>,
        reservedSeat: <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg"><path fillRule="evenodd" clipRule="evenodd" d="M15.4651 0H1.53491C0.690674 0 0 0.689941 0 1.53326V15.4667C0 16.3101 0.690674 17 1.53491 17H6H7H15.4651C16.3093 17 17 16.3101 17 15.4667V1.53326C17 0.689941 16.3093 0 15.4651 0ZM7 16.0417H11.9536C12.3757 16.0417 12.7212 15.6967 12.7212 15.2751H12.7021V13.8951C12.7021 13.4735 12.3567 13.1285 11.9346 13.1285H7V16.0417ZM6 13.1285H5.04639C4.62427 13.1285 4.27881 13.4735 4.27881 13.8951V15.2751C4.27881 15.6967 4.62427 16.0417 5.04639 16.0417H6V13.1285ZM2.24487 9.88953C1.9187 9.88953 1.65015 9.62122 1.65015 9.29535V4H4.56665V9.29535C4.56665 9.62122 4.29785 9.88953 3.97168 9.88953H2.24487ZM1.65015 2.06989V3H4.56665V2.06989C4.56665 1.74408 4.29785 1.47577 3.97168 1.47577H2.24487C1.9187 1.47577 1.65015 1.74408 1.65015 2.06989ZM12.2415 9.27618V4H15.1772V9.27618C15.1772 9.62122 14.8894 9.90869 14.5439 9.90869H12.8748C12.5293 9.90869 12.2415 9.62122 12.2415 9.27618ZM12.2415 3H15.1772V2.08905C15.1772 1.74408 14.8894 1.4566 14.5439 1.4566H12.8748C12.5293 1.4566 12.2415 1.74408 12.2415 2.08905V3Z" fill="#E5E5E5"/></svg>,
        sit: <svg width="14" height="23" viewBox="0 0 14 23" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M0 8.75326C0.141674 8.57335 0.25759 8.35002 0.437903 8.21975C1.03036 7.7979 1.79669 8.08947 1.97056 8.80288C2.12512 9.44806 2.25391 10.0994 2.38914 10.7508C2.62741 11.8737 2.85925 13.0027 3.10396 14.1256C3.42594 15.5834 4.41122 16.3527 5.9632 16.3589C7.07084 16.3651 8.17203 16.3527 9.27967 16.3651C9.93008 16.3713 10.2971 16.6566 10.4002 17.2025C10.5032 17.7919 10.0846 18.3378 9.46642 18.344C8.03036 18.3564 6.5943 18.3936 5.15823 18.3316C3.39374 18.2572 1.75161 16.8551 1.29439 15.0809C0.99816 13.9208 0.779209 12.7422 0.521619 11.5759C0.354186 10.8004 0.173873 10.0312 0 9.25575C0 9.08825 0 8.92075 0 8.75326Z" fill="#E5E5E5"/><path d="M4.53991 0C5.04865 0.105461 5.51875 0.266754 5.92445 0.601748C6.76806 1.29655 7.02565 2.56829 6.49759 3.51123C5.92445 4.54103 4.72022 5.04972 3.61902 4.73334C2.52427 4.41696 1.86741 3.65392 1.7837 2.50625C1.7193 1.62534 2.20872 0.694802 3.2262 0.235737C3.45803 0.130275 3.71562 0.0806467 3.96677 0C4.15352 0 4.34671 0 4.53991 0Z" fill="#E5E5E5"/><path d="M11.3469 15.875C11.1924 15.875 11.0829 15.875 10.9799 15.875C9.33128 15.875 7.68271 15.8812 6.02769 15.875C4.7655 15.8688 3.91546 15.1988 3.67075 14.0077C3.24572 11.9853 2.82714 9.96296 2.40212 7.94058C1.97065 5.8872 3.88326 4.89462 5.25492 5.32267C6.13073 5.59563 6.58151 6.22839 6.76182 7.05347C7.12245 8.70983 7.46375 10.3662 7.79862 12.0225C7.85658 12.3203 7.95317 12.432 8.28804 12.4258C9.62751 12.4134 10.967 12.4134 12.3064 12.4568C13.2144 12.4816 13.9164 13.1888 13.9808 14.0635C13.9937 14.2124 14.0001 14.3613 14.0001 14.5102C14.0001 16.8117 14.0001 19.1071 14.0001 21.4086C14.0001 21.6133 14.0001 21.8242 13.955 22.0227C13.8133 22.6493 13.2466 23.0401 12.5833 22.9967C11.9329 22.9533 11.4242 22.4756 11.3598 21.8428C11.3469 21.6939 11.3469 21.5451 11.3469 21.3962C11.3469 19.6778 11.3469 17.9532 11.3469 16.2348C11.3469 16.1293 11.3469 16.0177 11.3469 15.875Z" fill="#E5E5E5"/></svg>,
        luxe: <svg width="22" height="20" viewBox="0 0 22 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11 0L13.5857 7.63103H22L15.2072 12.369L17.7928 20L11 15.304L4.20717 20L6.79283 12.369L0 7.63103H8.41434L11 0Z" fill="#E5E5E5"/></svg>,
        wifi: <svg width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.4737 4.46617C19.2528 4.67493 19.0318 4.88369 18.8171 5.09878C18.6024 5.31387 18.4004 5.54161 18.1731 5.78833C15.8686 3.5552 13.16 2.37854 9.99058 2.37854C6.83374 2.37854 4.13779 3.5552 1.89644 5.72507C1.44817 5.28224 1.01883 4.85206 0.526367 4.35862C1.20825 3.82723 1.87118 3.22624 2.60988 2.73281C7.86918 -0.759218 14.6501 -0.151909 19.2338 4.20047C19.3096 4.27006 19.3917 4.33332 19.4737 4.39658C19.4737 4.42188 19.4737 4.44086 19.4737 4.46617Z" fill="#292929"/><path d="M9.68731 15.4735C9.60524 15.4356 9.52316 15.3913 9.43477 15.3533C8.76551 15.0687 8.39301 14.3665 8.53191 13.6516C8.67081 12.9431 9.29586 12.4307 10.0219 12.4307C10.7417 12.437 11.3668 12.9557 11.4993 13.6643C11.6319 14.3728 11.2468 15.075 10.5712 15.3533C10.4828 15.3913 10.4008 15.4292 10.3124 15.4672C10.104 15.4735 9.89566 15.4735 9.68731 15.4735Z" fill="#292929"/><path d="M4.5606 8.40099C4.11232 7.95816 3.68299 7.53431 3.25366 7.10413C6.51784 3.5615 12.8505 3.09336 16.7397 7.06617C16.304 7.49635 15.8621 7.92653 15.4138 8.36936C13.9364 6.9523 12.1244 6.15521 9.99036 6.16154C7.86265 6.16786 6.05694 6.95863 4.5606 8.40099Z" fill="#292929"/><path d="M14.1069 9.76737C13.6586 10.2102 13.2293 10.6404 12.8 11.0642C11.1142 9.47004 8.68343 9.64085 7.22497 11.0579C6.79564 10.6277 6.36631 10.2039 5.93066 9.7737C7.66061 7.74301 11.6319 7.23059 14.1069 9.76737Z" fill="#292929"/></svg>,
        express: <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M6.28438 17.3529C6.15378 17.357 6.07215 17.304 6.00073 17.2328C5.49056 16.7339 4.97631 16.2391 4.47022 15.7382C3.89884 15.1721 3.33561 14.5959 2.76014 14.0339C2.63158 13.9076 2.59893 13.7753 2.64995 13.6266C2.76218 13.2907 2.87442 12.9506 3.01523 12.6248C3.92128 10.5173 5.18038 8.63385 6.69455 6.91733C8.10057 5.32298 9.69638 3.9465 11.4922 2.80826C12.1289 2.40509 12.7941 2.05079 13.4451 1.67206C13.5124 1.63337 13.541 1.66799 13.5818 1.70668C14.2185 2.34197 14.8572 2.97727 15.4939 3.6146C16.4265 4.54515 17.3591 5.47773 18.2937 6.40624C18.3529 6.46529 18.357 6.50398 18.3202 6.57728C17.5244 8.13498 16.5591 9.57865 15.4205 10.9063C14.7001 11.7452 13.9185 12.525 13.0961 13.2642C11.2106 14.9583 9.09642 16.2961 6.72924 17.2226C6.6068 17.2714 6.48028 17.3101 6.35376 17.3509C6.32315 17.3529 6.2905 17.3509 6.28438 17.3529ZM7.63122 11.1221C7.56388 11.8633 8.25158 12.3764 8.85562 12.3723C9.53516 12.3662 10.1025 11.8063 10.1004 11.1241C10.0984 10.552 9.70046 9.88001 8.75767 9.89426C8.14751 9.90444 7.63122 10.4583 7.63122 11.1221ZM12.3941 8.81507C13.1125 8.89041 13.6471 8.16552 13.641 7.59742C13.6369 7.0171 13.1288 6.34719 12.3594 6.3533C11.7452 6.35737 11.1289 6.91733 11.1555 7.6076C11.182 8.3162 11.6738 8.81507 12.3941 8.81507Z" fill="#C4C4C4"/><path d="M18.7653 5.61827C17.2981 4.17256 15.8288 2.72686 14.3452 1.26486C14.6289 1.15287 14.8942 1.04291 15.1635 0.941104C16.1492 0.564406 17.1613 0.29359 18.2 0.13273C18.6184 0.0675711 19.0428 0.0248108 19.4673 0.00241249C19.8836 -0.0199858 20.0019 0.110331 19.9999 0.52979C19.9958 1.24246 19.8713 1.93885 19.7183 2.63319C19.4918 3.6574 19.1734 4.65515 18.7571 5.61827C18.751 5.63049 18.7449 5.64271 18.7388 5.65289C18.7469 5.64067 18.7571 5.62845 18.7653 5.61827Z" fill="#C4C4C4"/><path d="M6.97031 5.98269C6.92949 6.03156 6.89276 6.08247 6.84787 6.12726C5.62551 7.39989 4.58885 8.80895 3.70728 10.3341C3.3971 10.8716 3.11957 11.4255 2.83183 11.9752C2.78694 12.0608 2.74408 12.0811 2.65021 12.0547C1.8666 11.8307 1.08298 11.6148 0.299363 11.3929C0.050401 11.3216 -0.0618358 11.0834 0.0340756 10.839C0.0646856 10.7617 0.10754 10.6863 0.152434 10.6151C1.18705 9.00239 2.54002 7.72772 4.24602 6.84604C5.06432 6.42251 5.92753 6.12319 6.83766 5.96029C6.87644 5.95419 6.91521 5.95418 6.95398 5.95215C6.9601 5.96233 6.96419 5.97251 6.97031 5.98269Z" fill="#C4C4C4"/><path d="M7.90088 17.188C9.01917 16.6504 10.0946 16.0457 11.117 15.3452C12.1373 14.6468 13.0883 13.8608 13.9984 13.0239C14.0106 13.0321 14.0249 13.0402 14.0372 13.0484C14.029 13.1156 14.0229 13.1828 14.0106 13.2499C13.7066 14.8484 12.9944 16.2513 11.9741 17.5056C11.2292 18.4219 10.3538 19.1936 9.34975 19.8187C9.27017 19.8697 9.1865 19.9165 9.09875 19.9511C8.92121 20.0203 8.7498 19.9613 8.67225 19.7882C8.59471 19.6151 8.5294 19.4359 8.47635 19.2547C8.28248 18.5807 8.09474 17.9047 7.90496 17.2307C7.90292 17.2226 7.90292 17.2124 7.90088 17.188Z" fill="#C4C4C4"/><path d="M5.2338 17.7012C5.09708 17.805 4.96443 17.9231 4.81547 18.0147C4.23183 18.3772 3.60943 18.6684 2.9707 18.9168C2.04832 19.2772 1.11777 19.6132 0.18927 19.9593C0.146416 19.9756 0.0994811 19.9838 0.0341797 20C0.109684 19.7822 0.174986 19.5847 0.246409 19.3892C0.672909 18.2163 1.10349 17.0435 1.65651 15.9215C1.83405 15.5632 2.01771 15.2068 2.28912 14.9055C2.31361 14.879 2.34014 14.8525 2.3585 14.8322C3.31149 15.7851 4.26244 16.7319 5.2338 17.7012Z" fill="#C4C4C4"/></svg>,
        plus: <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M9.22204 4.20293L9.22204 9.18841L4.23656 9.18841C3.7728 9.18841 3.42497 9.53623 3.42497 10C3.42497 10.4638 3.7728 10.8116 4.23656 10.8116L9.22204 10.8116L9.22204 15.7971C9.22204 16.2608 9.56987 16.6087 9.97566 16.5507L10.0916 16.5507C10.5554 16.5507 10.9032 16.2029 10.8452 15.7971L10.8452 10.8116L15.7148 10.8116C16.1785 10.8116 16.5264 10.4638 16.5264 10C16.5264 9.53623 16.1785 9.18841 15.7148 9.18841L10.8452 9.18841L10.8452 4.20293C10.8452 3.73916 10.4974 3.39134 10.0916 3.44931L9.97566 3.44931C9.5119 3.44931 9.16407 3.79714 9.22204 4.20293Z" fill="white"/><rect x="1" y="1" width="18" height="18" rx="4" stroke="white" strokeWidth="2"/></svg>,
        minus: <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><rect x="1" y="1" width="18" height="18" rx="4" stroke="#C4C4C4" strokeWidth="2"/><line x1="5.61523" y1="9.76904" x2="14.3845" y2="9.76904" stroke="#C4C4C4" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/></svg>  
    }

    function clickSlidersNameHandler(event){
        if(event.target.localName == 'img') {return}
        if(ticketData.date_end == '' && event.target.parentElement.parentElement.id == 'fromBlock'){return}
        event.target.parentElement.parentElement.classList.toggle('active_sliders')
        if (event.target.parentElement.parentElement.classList.contains('active_sliders')){
            event.target.parentElement.parentElement.id == 'thereBlock' ? setActiveThereSlider(true) : setActiveFromSlider(true)
        } else {
            event.target.parentElement.parentElement.id == 'thereBlock' ? setActiveThereSlider(false) : setActiveFromSlider(false)
        }
    }


    return (
        <div className="sidebar_container">
            <div className="sidebar_content">
                <div className="content_block">
                    <p className="block_name">Дата поездки</p>
                    <label htmlFor="">
                        <DateInput id={'side_date_start'} type={'date_start'} />
                    </label>
                    <p className="block_name">Дата возвращения</p>
                    <label htmlFor="">
                        <DateInput id={'side_date_end'} type={'date_end'} />
                    </label>
                </div>
                <div className="content_block">
                    <ul className="content_list">
                        <li className="list_item"><p>{svgs.coupe} Купе</p> <Checkbox type='have_second_class' /></li>
                        <li className="list_item"><p>{svgs.reservedSeat} Плацкарт</p> <Checkbox type='have_third_class' /></li>
                        <li className="list_item"><p>{svgs.sit} Сидячий</p> <Checkbox type='have_fourth_class' /></li>
                        <li className="list_item"><p>{svgs.luxe} Люкс</p>  <Checkbox type='have_first_class' /></li>
                        <li className="list_item"><p>{svgs.wifi} Wi-Fi</p> <Checkbox type='have_wifi' /></li>
                        <li className="list_item"><p>{svgs.express} Экспресс</p> <Checkbox type='have_express' /></li>
                    </ul>
                </div>
                <div className="content_block">
                    <p className="block_name">Стоимость</p>
                    <RangeSliderPrice />
                </div>
                <div id='thereBlock' className="content_block">
                    <div onClick={(e) => clickSlidersNameHandler(e)} className="name_wrapper">
                        <p className="block_name"><img src={arrowTo} alt="" />Туда</p>
                        {activeThereSlider ? svgs.minus : svgs.plus}
                    </div>
                    <div className="block_sliders">
                        <div className="sliders_row">
                            <p className="row_name">Время отбытия</p>
                            <RangeSliderTime id={'time_to1'} settingsName={['start_departure_hour_from', 'start_departure_hour_to']}/>
                        </div>
                        <div className="sliders_row">
                            <p className="row_name" style={{textAlign: 'right', marginTop: 46 + 'px'}}>Время прибытия</p>
                            <RangeSliderTime id={'time_to2'} settingsName={['start_arrival_hour_from', 'start_arrival_hour_to']}/>
                        </div>
                    </div>
                </div>
                <div id='fromBlock' className="content_block">
                    <div onClick={(e) => clickSlidersNameHandler(e)} className="name_wrapper">
                        <p className="block_name"><img src={arrowFrom} alt="" />Обратно</p>
                        {activeFromSlider ? svgs.minus : svgs.plus}
                    </div>
                    <div className="block_sliders">
                        <div className="sliders_row">
                            <p className="row_name">Время отбытия</p>
                            <RangeSliderTime id={'time_from1'} settingsName={['end_departure_hour_from', 'end_departure_hour_to']}/>
                        </div>
                        <div className="sliders_row">
                            <p className="row_name" style={{textAlign: 'right', marginTop: 46 + 'px'}}>Время прибытия</p>
                            <RangeSliderTime id={'time_from2'} settingsName={['end_arrival_hour_from', 'end_arrival_hour_to']}/>
                        </div>
                    </div>
                </div>
            </div>
        </div>
  )
}

export default SidebarSettings